"""
Python的运算符：1、算术运算符；2、赋值运算符
"""
# 算数运算符——加（+）
print("1 + 1 =", 1 + 1)

# 算数运算符——减（-）
print("2 - 1 = ", 2 - 1)

# 算数运算符——乘（*）
print("3 * 3 = ", 3 * 3)

# 算数运算符——除（/）
print("4 / 2 = ", 4 / 2)

# 算数运算符——取整除（//）
print("11 // 2 = ", 11 // 2)

# 算数运算符——取余（%）
print("9 % 2 = ", 9 % 2)

# 算数运算符——指数（**）
print("2 ** a = ", 2 ** 2)

# ——————————————————————————————————————————————————————

# 赋值运算符——等于（=）
num = 1 + 2 * 3
print("num = ", num)  # 7
# 赋值运算符——加法赋值运算符(+=)
num = 1
num += 1
print("num += 1：", num)  # 2
# 赋值运算符——减法赋值运算符(-=)
num -= 1
print("num -= 1：", num)  # 1
# 赋值运算符——乘法赋值运算符(*=)
num *= 4
print("num *= 4：", num)  # 4
# 赋值运算符——除法赋值运算符(/=)
num /= 2
print("num /= 2：", num)  # 2
# 赋值运算符——取余赋值运算符(%=)
num = 3
num %= 2
print("num %= 2：", num)  # 1
# 赋值运算符——幂赋值运算符(**=)
num **= 2
print("num **= 2：", num)  # 1
# 赋值运算符——取整除赋值运算符(//=)
num = 9
num //= 2
print("num //= 2：", num)  # 4
